# Practical No.10:  Write a Pandas program to implement following operation

In [3]:
import pandas as pd
import numpy as np

* to find and drop the missing values from the given dataset

In [15]:
data = {
    'Name': ['Amit', 'Bhavya', 'Chirag', 'Amit', 'Divya', None],
    'Age': [21, 22, 23, 21, None, 25],
    'City': ['Delhi', 'Mumbai', 'Ahmedabad', 'Delhi', 'Pune', 'Surat']
}

df = pd.DataFrame(data)
print("Before dropping missing values")
display(df)
print()
df = df.dropna()

print("After dropping missing values:")
display(df)

Before dropping missing values

     Name   Age       City
0    Amit  21.0      Delhi
1  Bhavya  22.0     Mumbai
2  Chirag  23.0  Ahmedabad
3    Amit  21.0      Delhi
4   Divya   NaN       Pune
5    None  25.0      Surat

After dropping missing values:

     Name   Age       City
0    Amit  21.0      Delhi
1  Bhavya  22.0     Mumbai
2  Chirag  23.0  Ahmedabad
3    Amit  21.0      Delhi

* to remove the duplicates from the given dataset

In [8]:
df = df.drop_duplicates()

print("After removing duplicates:")
display(df)

After removing duplicates:

     Name   Age       City
0    Amit  21.0      Delhi
1  Bhavya  22.0     Mumbai
2  Chirag  23.0  Ahmedabad